# Lambda Functions - Lab

## Introduction

In this lab, you'll get some hands-on practice creating and using lambda functions.

## Objectives

In this lab you will:

* Create lambda functions to use as arguments of other functions   
* Use the `.map()` or `.apply()` method to apply a function to a pandas series or DataFrame

## Lambda Functions

In [9]:
import pandas as pd
df = pd.read_csv('Yelp_Reviews.csv', index_col=0)
df.head(2)

,business_id,cool,date,funny,review_id,stars,text,useful,user_id
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g
2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g

## Simple arithmetic

Use a lambda function to create a new column called `'stars_squared'` by squaring the stars column.

In [10]:
# Your code here
df['stars_squared'] = df['stars'].apply(lambda star: star*star)
df[['stars_squared', 'stars']]

      stars_squared  stars
1                25      5
2                 1      1
4                25      5
5                 1      1
10               25      5
...             ...    ...
689              25      5
4874             25      5
564              25      5
3458              4      2
4206              1      1

[2610 rows x 2 columns]

## Dates
Select the month from the date string using a lambda function.

In [11]:
# Your code here
df['month']=df['date'].apply(lambda date:date[5:7])
df[['month', 'date']]

     month        date
1       11  2012-11-13
2       10  2014-10-23
4       09  2014-09-05
5       02  2011-02-25
10      06  2016-06-15
...    ...         ...
689     06  2013-06-02
4874    08  2016-08-14
564     06  2016-06-14
3458    10  2013-10-02
4206    08  2016-08-15

[2610 rows x 2 columns]

## What is the average number of words for a yelp review?
Do this with a single line of code.

In [12]:
# Your code here
df['text'].apply(lambda text: len(text.split())).mean()

77.06551724137931

## Create a new column for the number of words in the review

In [13]:
# Your code here
df['Review_num_words'] = df['text'].apply(lambda text: len(text.split()))

In [14]:
df.head(2)

,business_id,cool,date,funny,review_id,stars,text,useful,user_id,stars_squared,month,Review_num_words
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g,25,11,58
2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g,1,10,30

## Rewrite the following as a lambda function

Create a new column `'Review_Length'` by applying this lambda function to the `'Review_num_words'` column.

In [20]:
# Rewrite the following function as a lambda function
def rewrite_as_lambda(value):
    if len(value) < 50:
        return 'Short'
    elif len(value) < 80:
        return 'Medium'
    else:
        return 'Long'
# Hint: nest your if, else conditionals

df['Review_length'] = df['Review_num_words'].apply(lambda value: 'short' if value < 50 else ('medium' if value < 80 else 'long'))

## Level Up: Dates Advanced
<img src="images/world_map.png" width="600">  

Print the first five rows of the `'date'` column.

In [23]:
# Your code here
df[['date']].head()

          date
1   2012-11-13
2   2014-10-23
4   2014-09-05
5   2011-02-25
10  2016-06-15

Overwrite the `'date'` column by reordering the month and day from `YYYY-MM-DD` to `DD-MM-YYYY`. Try to do this using a lambda function.

In [25]:
# Your code here
df['date'].apply(lambda date: f"{pd.to_datetime(date).day}-{pd.to_datetime(date).month}-{pd.to_datetime(date).year}")

1       13-11-2012
2       23-10-2014
4         5-9-2014
5        25-2-2011
10       15-6-2016
           ...
689       2-6-2013
4874     14-8-2016
564      14-6-2016
3458     2-10-2013
4206     15-8-2016
Name: date, Length: 2610, dtype: object

## Summary

Hopefully, you're getting the hang of lambda functions now! It's important not to overuse them - it will often make more sense to define a function so that it's reusable elsewhere. But whenever you need to quickly apply some simple processing to a collection of data you have a new technique that will help you to do just that. It'll also be useful if you're reading someone else's code that happens to use lambdas.